/**
 * Класс CoffeeOrder
 *
 * В этом классе у вас должен быть метод main:
 * 1. Создание объекта Scanner для ввода пользователя.
 * 2. Логика меню (switch или if-else) для выбора кофе и сахара.
 * 3. Создание объекта Coffee и объекта Sugar, исходя из выбора пользователя.
 * 4. Вызов методов (например, coffee.calculatePriceWithSugar(sugar)).
 * 5. Вывод информации о заказе (название кофе, уровень сахара, итоговая цена).
 * 6. (Опционально) повтор решения в цикле до выхода из программы.
 */
public class CoffeeOrder {

    public static void main(String[] args) {
        // Напишите вашу логику здесь:
        // 1) Создать Scanner;
        // 2) Спросить пользователя, какой кофе (название, цена) или номер опции;
        // 3) Спросить пользователя, какой сахар (номер опции, уровень, цена);
        // 4) Создать объекты Coffee и Sugar (конструкторы, сеттеры);
        // 5) Вычислить общую стоимость и вывести результат;
        // 6) (Опционально) продолжать спрашивать, пока пользователь не решит завершить.
        System.out.println("Hello!");
        System.out.println("Hello again!");
    }
}
